/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'Adguard icon' button */
"accept_caption" = "Accept";

/* (AEService) The default message for an unknown error. */
"support_unexpected_error" = "An unexpected error occurred. Please contact the support team.";

/* (Action Extension - ActionViewController) An error which occurs if the action extension is launched before the main Adguard app. */
"action_extension_no_configuration_message_format" = "Before you can use this action extension, %1$@ has to perform an initial configuration. Launch the main %2$@ app to let it do so.";

/* (AESFilterConverter) Error occured when checking of the result from JSON converter. */
"support_rule_converting_error" = "Cannot convert rules. An unexpected error occurred. Please contact the support team.";

/* (AEService) Service errors descriptions */
"json_converting_error" = "Cannot initialize converter to JSON format.";

/* (AEUIAboutController) Alert message if user have no e-mail account on device */
"support_message_sending_error" = "Cannot send a message to the support team. You have not configured your email account yet.";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'close icon' button */
"common_action_cancel" = "Cancel";

/* (AEService) Service errors descriptions */
"rule_converting_error" = "Cannot convert the filter rule. Rule text is invalid.";

/* (AEUIUtils) User filter convertering error description. */
"filter_rules_converting_error" = "Cannot convert the user filter rules.";

/* (Action Extension - AEAUIMainController) Label on switcher. Example: 'Enable filtering on www.github.com' */
"enable_filtering_format" = "Enable filtering on %@";

/* Alert title. On error. */
"common_error_title" = "Error";

/* (AEService) Service errors descriptions */
"safari_filters_loading_error" = "Filters cannot be loaded into Safari. Therefore, your recent changes were not applied.";

/* (Action Extension - AEAUIMainController) Mail body to support team about incorrect blocking */
"incorrect_blocking_page_format" = "Incorrect blocking on page:\n%@";

/* (AEUILoadingModal) Standard message when filter conversion is performed. */
"safari_filters_loading" = "Loading filters to Safari. Please do not turn off AdGuard. The process will take no more than 30 seconds.";

/* (Action Extension - AEAUIMainController) error occurs when content blocker is disabled. */
"content_blocker_disabled_format" = "Note that Content blocker is disabled. That means ads will not be filtered regardless of AdGuard settings. Please enable AdGuard Content blocker in Safari settings to start filtering.";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'eye icon' button */
"preview_caption" = "Preview";

/* (Action Extension - ActionViewController) Can't obtain hostname when starting. */
"hostname_obtaining_error" = "The hostname is not obtained. Perhaps the page has not been loaded yet.";

/* (Action Extension - AEAUIMainController) error occurs when click on Block Element button. */
"assistant_launching_unable" = "This website's security policy does not allow launching AdGuard Assistant.";

/* (Action Extension - ActionViewController) Some errors when starting. */
"support_error_safari_extension" = "An unexpected error occurred while initializing Safari action extension. Please contact AdGuard Support if this happens again.";

/* (APUIAdguardDNSController) PRO version. Alert title. On warning. */
"common_warning_title" = "Warning";

/* (Action Extension - AEAUIMainController) error occurs when try turn off filtration on site. */
"filter_rules_maximum" = "You have exceeded the maximum number of the filter rules.";

